; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l5-t1-p4---int100n150-m25---int100c110---s33---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 - location
t0 - truck
p0 p1 p2 p3 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 - fuellevel
)

(:init
(sum level0 level2 level2)
(sum level0 level8 level8)
(sum level0 level19 level19)
(sum level0 level20 level20)
(sum level0 level22 level22)
(sum level0 level24 level24)
(sum level0 level25 level25)
(sum level1 level2 level3)
(sum level1 level8 level9)
(sum level1 level19 level20)
(sum level1 level20 level21)
(sum level1 level22 level23)
(sum level1 level24 level25)
(sum level1 level25 level26)
(sum level2 level2 level4)
(sum level2 level8 level10)
(sum level2 level19 level21)
(sum level2 level20 level22)
(sum level2 level22 level24)
(sum level2 level24 level26)
(sum level2 level25 level27)
(sum level3 level2 level5)
(sum level3 level8 level11)
(sum level3 level19 level22)
(sum level3 level20 level23)
(sum level3 level22 level25)
(sum level3 level24 level27)
(sum level3 level25 level28)
(sum level4 level2 level6)
(sum level4 level8 level12)
(sum level4 level19 level23)
(sum level4 level20 level24)
(sum level4 level22 level26)
(sum level4 level24 level28)
(sum level4 level25 level29)
(sum level5 level2 level7)
(sum level5 level8 level13)
(sum level5 level19 level24)
(sum level5 level20 level25)
(sum level5 level22 level27)
(sum level5 level24 level29)
(sum level5 level25 level30)
(sum level6 level2 level8)
(sum level6 level8 level14)
(sum level6 level19 level25)
(sum level6 level20 level26)
(sum level6 level22 level28)
(sum level6 level24 level30)
(sum level6 level25 level31)
(sum level7 level2 level9)
(sum level7 level8 level15)
(sum level7 level19 level26)
(sum level7 level20 level27)
(sum level7 level22 level29)
(sum level7 level24 level31)
(sum level7 level25 level32)
(sum level8 level2 level10)
(sum level8 level8 level16)
(sum level8 level19 level27)
(sum level8 level20 level28)
(sum level8 level22 level30)
(sum level8 level24 level32)
(sum level8 level25 level33)
(sum level9 level2 level11)
(sum level9 level8 level17)
(sum level9 level19 level28)
(sum level9 level20 level29)
(sum level9 level22 level31)
(sum level9 level24 level33)
(sum level9 level25 level34)
(sum level10 level2 level12)
(sum level10 level8 level18)
(sum level10 level19 level29)
(sum level10 level20 level30)
(sum level10 level22 level32)
(sum level10 level24 level34)
(sum level10 level25 level35)
(sum level11 level2 level13)
(sum level11 level8 level19)
(sum level11 level19 level30)
(sum level11 level20 level31)
(sum level11 level22 level33)
(sum level11 level24 level35)
(sum level11 level25 level36)
(sum level12 level2 level14)
(sum level12 level8 level20)
(sum level12 level19 level31)
(sum level12 level20 level32)
(sum level12 level22 level34)
(sum level12 level24 level36)
(sum level12 level25 level37)
(sum level13 level2 level15)
(sum level13 level8 level21)
(sum level13 level19 level32)
(sum level13 level20 level33)
(sum level13 level22 level35)
(sum level13 level24 level37)
(sum level13 level25 level38)
(sum level14 level2 level16)
(sum level14 level8 level22)
(sum level14 level19 level33)
(sum level14 level20 level34)
(sum level14 level22 level36)
(sum level14 level24 level38)
(sum level14 level25 level39)
(sum level15 level2 level17)
(sum level15 level8 level23)
(sum level15 level19 level34)
(sum level15 level20 level35)
(sum level15 level22 level37)
(sum level15 level24 level39)
(sum level15 level25 level40)
(sum level16 level2 level18)
(sum level16 level8 level24)
(sum level16 level19 level35)
(sum level16 level20 level36)
(sum level16 level22 level38)
(sum level16 level24 level40)
(sum level16 level25 level41)
(sum level17 level2 level19)
(sum level17 level8 level25)
(sum level17 level19 level36)
(sum level17 level20 level37)
(sum level17 level22 level39)
(sum level17 level24 level41)
(sum level17 level25 level42)
(sum level18 level2 level20)
(sum level18 level8 level26)
(sum level18 level19 level37)
(sum level18 level20 level38)
(sum level18 level22 level40)
(sum level18 level24 level42)
(sum level18 level25 level43)
(sum level19 level2 level21)
(sum level19 level8 level27)
(sum level19 level19 level38)
(sum level19 level20 level39)
(sum level19 level22 level41)
(sum level19 level24 level43)
(sum level19 level25 level44)
(sum level20 level2 level22)
(sum level20 level8 level28)
(sum level20 level19 level39)
(sum level20 level20 level40)
(sum level20 level22 level42)
(sum level20 level24 level44)
(sum level20 level25 level45)
(sum level21 level2 level23)
(sum level21 level8 level29)
(sum level21 level19 level40)
(sum level21 level20 level41)
(sum level21 level22 level43)
(sum level21 level24 level45)
(sum level21 level25 level46)
(sum level22 level2 level24)
(sum level22 level8 level30)
(sum level22 level19 level41)
(sum level22 level20 level42)
(sum level22 level22 level44)
(sum level22 level24 level46)
(sum level22 level25 level47)
(sum level23 level2 level25)
(sum level23 level8 level31)
(sum level23 level19 level42)
(sum level23 level20 level43)
(sum level23 level22 level45)
(sum level23 level24 level47)
(sum level23 level25 level48)
(sum level24 level2 level26)
(sum level24 level8 level32)
(sum level24 level19 level43)
(sum level24 level20 level44)
(sum level24 level22 level46)
(sum level24 level24 level48)
(sum level24 level25 level49)
(sum level25 level2 level27)
(sum level25 level8 level33)
(sum level25 level19 level44)
(sum level25 level20 level45)
(sum level25 level22 level47)
(sum level25 level24 level49)
(sum level25 level25 level50)
(sum level26 level2 level28)
(sum level26 level8 level34)
(sum level26 level19 level45)
(sum level26 level20 level46)
(sum level26 level22 level48)
(sum level26 level24 level50)
(sum level26 level25 level51)
(sum level27 level2 level29)
(sum level27 level8 level35)
(sum level27 level19 level46)
(sum level27 level20 level47)
(sum level27 level22 level49)
(sum level27 level24 level51)
(sum level27 level25 level52)
(sum level28 level2 level30)
(sum level28 level8 level36)
(sum level28 level19 level47)
(sum level28 level20 level48)
(sum level28 level22 level50)
(sum level28 level24 level52)
(sum level28 level25 level53)
(sum level29 level2 level31)
(sum level29 level8 level37)
(sum level29 level19 level48)
(sum level29 level20 level49)
(sum level29 level22 level51)
(sum level29 level24 level53)
(sum level29 level25 level54)
(sum level30 level2 level32)
(sum level30 level8 level38)
(sum level30 level19 level49)
(sum level30 level20 level50)
(sum level30 level22 level52)
(sum level30 level24 level54)
(sum level30 level25 level55)
(sum level31 level2 level33)
(sum level31 level8 level39)
(sum level31 level19 level50)
(sum level31 level20 level51)
(sum level31 level22 level53)
(sum level31 level24 level55)
(sum level31 level25 level56)
(sum level32 level2 level34)
(sum level32 level8 level40)
(sum level32 level19 level51)
(sum level32 level20 level52)
(sum level32 level22 level54)
(sum level32 level24 level56)
(sum level32 level25 level57)
(sum level33 level2 level35)
(sum level33 level8 level41)
(sum level33 level19 level52)
(sum level33 level20 level53)
(sum level33 level22 level55)
(sum level33 level24 level57)
(sum level33 level25 level58)
(sum level34 level2 level36)
(sum level34 level8 level42)
(sum level34 level19 level53)
(sum level34 level20 level54)
(sum level34 level22 level56)
(sum level34 level24 level58)
(sum level34 level25 level59)
(sum level35 level2 level37)
(sum level35 level8 level43)
(sum level35 level19 level54)
(sum level35 level20 level55)
(sum level35 level22 level57)
(sum level35 level24 level59)
(sum level35 level25 level60)
(sum level36 level2 level38)
(sum level36 level8 level44)
(sum level36 level19 level55)
(sum level36 level20 level56)
(sum level36 level22 level58)
(sum level36 level24 level60)
(sum level36 level25 level61)
(sum level37 level2 level39)
(sum level37 level8 level45)
(sum level37 level19 level56)
(sum level37 level20 level57)
(sum level37 level22 level59)
(sum level37 level24 level61)
(sum level37 level25 level62)
(sum level38 level2 level40)
(sum level38 level8 level46)
(sum level38 level19 level57)
(sum level38 level20 level58)
(sum level38 level22 level60)
(sum level38 level24 level62)
(sum level38 level25 level63)
(sum level39 level2 level41)
(sum level39 level8 level47)
(sum level39 level19 level58)
(sum level39 level20 level59)
(sum level39 level22 level61)
(sum level39 level24 level63)
(sum level39 level25 level64)
(sum level40 level2 level42)
(sum level40 level8 level48)
(sum level40 level19 level59)
(sum level40 level20 level60)
(sum level40 level22 level62)
(sum level40 level24 level64)
(sum level40 level25 level65)
(sum level41 level2 level43)
(sum level41 level8 level49)
(sum level41 level19 level60)
(sum level41 level20 level61)
(sum level41 level22 level63)
(sum level41 level24 level65)
(sum level41 level25 level66)
(sum level42 level2 level44)
(sum level42 level8 level50)
(sum level42 level19 level61)
(sum level42 level20 level62)
(sum level42 level22 level64)
(sum level42 level24 level66)
(sum level42 level25 level67)
(sum level43 level2 level45)
(sum level43 level8 level51)
(sum level43 level19 level62)
(sum level43 level20 level63)
(sum level43 level22 level65)
(sum level43 level24 level67)
(sum level43 level25 level68)
(sum level44 level2 level46)
(sum level44 level8 level52)
(sum level44 level19 level63)
(sum level44 level20 level64)
(sum level44 level22 level66)
(sum level44 level24 level68)
(sum level44 level25 level69)
(sum level45 level2 level47)
(sum level45 level8 level53)
(sum level45 level19 level64)
(sum level45 level20 level65)
(sum level45 level22 level67)
(sum level45 level24 level69)
(sum level45 level25 level70)
(sum level46 level2 level48)
(sum level46 level8 level54)
(sum level46 level19 level65)
(sum level46 level20 level66)
(sum level46 level22 level68)
(sum level46 level24 level70)
(sum level46 level25 level71)
(sum level47 level2 level49)
(sum level47 level8 level55)
(sum level47 level19 level66)
(sum level47 level20 level67)
(sum level47 level22 level69)
(sum level47 level24 level71)
(sum level47 level25 level72)
(sum level48 level2 level50)
(sum level48 level8 level56)
(sum level48 level19 level67)
(sum level48 level20 level68)
(sum level48 level22 level70)
(sum level48 level24 level72)
(sum level48 level25 level73)
(sum level49 level2 level51)
(sum level49 level8 level57)
(sum level49 level19 level68)
(sum level49 level20 level69)
(sum level49 level22 level71)
(sum level49 level24 level73)
(sum level49 level25 level74)
(sum level50 level2 level52)
(sum level50 level8 level58)
(sum level50 level19 level69)
(sum level50 level20 level70)
(sum level50 level22 level72)
(sum level50 level24 level74)
(sum level50 level25 level75)
(sum level51 level2 level53)
(sum level51 level8 level59)
(sum level51 level19 level70)
(sum level51 level20 level71)
(sum level51 level22 level73)
(sum level51 level24 level75)
(sum level51 level25 level76)
(sum level52 level2 level54)
(sum level52 level8 level60)
(sum level52 level19 level71)
(sum level52 level20 level72)
(sum level52 level22 level74)
(sum level52 level24 level76)
(sum level52 level25 level77)
(sum level53 level2 level55)
(sum level53 level8 level61)
(sum level53 level19 level72)
(sum level53 level20 level73)
(sum level53 level22 level75)
(sum level53 level24 level77)
(sum level53 level25 level78)
(sum level54 level2 level56)
(sum level54 level8 level62)
(sum level54 level19 level73)
(sum level54 level20 level74)
(sum level54 level22 level76)
(sum level54 level24 level78)
(sum level54 level25 level79)
(sum level55 level2 level57)
(sum level55 level8 level63)
(sum level55 level19 level74)
(sum level55 level20 level75)
(sum level55 level22 level77)
(sum level55 level24 level79)
(sum level55 level25 level80)
(sum level56 level2 level58)
(sum level56 level8 level64)
(sum level56 level19 level75)
(sum level56 level20 level76)
(sum level56 level22 level78)
(sum level56 level24 level80)
(sum level57 level2 level59)
(sum level57 level8 level65)
(sum level57 level19 level76)
(sum level57 level20 level77)
(sum level57 level22 level79)
(sum level58 level2 level60)
(sum level58 level8 level66)
(sum level58 level19 level77)
(sum level58 level20 level78)
(sum level58 level22 level80)
(sum level59 level2 level61)
(sum level59 level8 level67)
(sum level59 level19 level78)
(sum level59 level20 level79)
(sum level60 level2 level62)
(sum level60 level8 level68)
(sum level60 level19 level79)
(sum level60 level20 level80)
(sum level61 level2 level63)
(sum level61 level8 level69)
(sum level61 level19 level80)
(sum level62 level2 level64)
(sum level62 level8 level70)
(sum level63 level2 level65)
(sum level63 level8 level71)
(sum level64 level2 level66)
(sum level64 level8 level72)
(sum level65 level2 level67)
(sum level65 level8 level73)
(sum level66 level2 level68)
(sum level66 level8 level74)
(sum level67 level2 level69)
(sum level67 level8 level75)
(sum level68 level2 level70)
(sum level68 level8 level76)
(sum level69 level2 level71)
(sum level69 level8 level77)
(sum level70 level2 level72)
(sum level70 level8 level78)
(sum level71 level2 level73)
(sum level71 level8 level79)
(sum level72 level2 level74)
(sum level72 level8 level80)
(sum level73 level2 level75)
(sum level74 level2 level76)
(sum level75 level2 level77)
(sum level76 level2 level78)
(sum level77 level2 level79)
(sum level78 level2 level80)

(connected l0 l3)
(fuelcost level8 l0 l3)
(connected l0 l4)
(fuelcost level19 l0 l4)
(connected l1 l2)
(fuelcost level22 l1 l2)
(connected l1 l4)
(fuelcost level2 l1 l4)
(connected l2 l1)
(fuelcost level22 l2 l1)
(connected l2 l3)
(fuelcost level20 l2 l3)
(connected l2 l4)
(fuelcost level24 l2 l4)
(connected l3 l0)
(fuelcost level8 l3 l0)
(connected l3 l2)
(fuelcost level20 l3 l2)
(connected l3 l4)
(fuelcost level25 l3 l4)
(connected l4 l0)
(fuelcost level19 l4 l0)
(connected l4 l1)
(fuelcost level2 l4 l1)
(connected l4 l2)
(fuelcost level24 l4 l2)
(connected l4 l3)
(fuelcost level25 l4 l3)

(at t0 l1)
(fuel t0 level80)
(= (total-cost) 0)

(at p0 l2)
(at p1 l1)
(at p2 l2)
(at p3 l3)
)

(:goal
(and
(at p0 l4)
(at p1 l0)
(at p2 l1)
(at p3 l2)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p1 t0 l1)
   deleted: (at p1 l1)
   added: (in p1 t0)
   goals met: 0 of 4
2. (drive t0 l1 l4 level78 level2 level80)
   deleted: (at t0 l1) (fuel t0 level80)
   added: (at t0 l4) (fuel t0 level78)
   goals met: 0 of 4
3. (drive t0 l4 l0 level59 level19 level78)
   deleted: (at t0 l4) (fuel t0 level78)
   added: (at t0 l0) (fuel t0 level59)
   goals met: 0 of 4
4. (unload p1 t0 l0)
   deleted: (in p1 t0)
   added: (at p1 l0)
   goals met: 1 of 4
5. (drive t0 l0 l3 level51 level8 level59)
   deleted: (at t0 l0) (fuel t0 level59)
   added: (at t0 l3) (fuel t0 level51)
   goals met: 1 of 4
6. (load p3 t0 l3)
   deleted: (at p3 l3)
   added: (in p3 t0)
   goals met: 1 of 4
7. (drive t0 l3 l2 level31 level20 level51)
   deleted: (at t0 l3) (fuel t0 level51)
   added: (at t0 l2) (fuel t0 level31)
   goals met: 1 of 4
8. (load p0 t0 l2)
   deleted: (at p0 l2)
   added: (in p0 t0)
   goals met: 1 of 4
9. (load p2 t0 l2)
   deleted: (at p2 l2)
   added: (in p2 t0)
   goals met: 1 of 4
10. (unload p3 t0 l2)
   deleted: (in p3 t0)
   added: (at p3 l2)
   goals met: 2 of 4
11. (drive t0 l2 l1 level9 level22 level31)
   deleted: (at t0 l2) (fuel t0 level31)
   added: (at t0 l1) (fuel t0 level9)
   goals met: 2 of 4
12. (unload p2 t0 l1)
   deleted: (in p2 t0)
   added: (at p2 l1)
   goals met: 3 of 4
13. (drive t0 l1 l4 level7 level2 level9)
   deleted: (at t0 l1) (fuel t0 level9)
   added: (at t0 l4) (fuel t0 level7)
   goals met: 3 of 4
14. (unload p0 t0 l4)
   deleted: (in p0 t0)
   added: (at p0 l4)
   goals met: 4 of 4
